backend/controllers/FileController.php

SELECT * FROM `file` WHERE `fid`='4'
---
    protected function findModel($id)
    {
        if (($model = File::findOne($id)) !== null) {